#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.google_client_config.provider: Reading...
module.vpc.module.vpc.module.vpc.google_compute_network.network: Refreshing state... [id=projects/tbd-2025z-318384/global/networks/main-vpc]
module.composer.google_compute_subnetwork.composer-subnet: Refreshing state... [id=projects/tbd-2025z-318384/regions/europe-west1/subnetworks/composer-subnet-01]
data.google_client_config.provider: Read complete after 0s [id=projects/"tbd-2025z-318384"/regions/"europe-west1"/zones/<null>]
module.vpc.google_compute_firewall.fw-allow-ingress-from-iap: Refreshing state... [id=projects/tbd-2025z-318384/global/firewalls/fw-allow-ingress-iap]
module.vpc.module.cloud-router.google_compute_router.router: Refreshing state... [id=projects/tbd-2025z-318384/regions/europe-west1/routers/nat-router]
module.vpc.module.vpc.module.subnets.google_compute_subnetwork.subnetwork["europe-west1/subnet-01"]: Refreshing state... [id=projects/tbd-2025z-318384/regions/europe-west1/subnetworks/subnet-01]
module.vpc.google_compute_firewall.default-internal-allow-all: Refreshing state... [id=projects/tbd-2025z-318384/global/firewalls/default-internal-allow-all]
module.vpc.module.vpc.module.routes.google_compute_route.route["egress-internet"]: Refreshing state... [id=projects/tbd-2025z-318384/global/routes/egress-internet]
module.vpc.module.cloud-router.google_compute_router_nat.nats["nat-gateway"]: Refreshing state... [id=tbd-2025z-318384/europe-west1/nat-router/nat-gateway]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # google_compute_firewall.allow-all-internal will be created
  + resource "google_compute_firewall" "allow-all-internal" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "allow-all-internal"
      + network            = "main-vpc"
      + priority           = 1000
      + project            = "tbd-2025z-318384"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "10.0.0.0/8",
        ]

      + allow {
          + ports    = []
          + protocol = "all"
        }
    }

  # module.composer.google_compute_subnetwork.composer-subnet will be destroyed
  # (because google_compute_subnetwork.composer-subnet is not in configuration)
  - resource "google_compute_subnetwork" "composer-subnet" {
      - creation_timestamp         = "2025-11-23T09:24:26.503-08:00" -> null
      - gateway_address            = "10.11.0.1" -> null
      - id                         = "projects/tbd-2025z-318384/regions/europe-west1/subnetworks/composer-subnet-01" -> null
      - ip_cidr_range              = "10.11.0.0/16" -> null
      - name                       = "composer-subnet-01" -> null
      - network                    = "https://www.googleapis.com/compute/v1/projects/tbd-2025z-318384/global/networks/main-vpc" -> null
      - private_ip_google_access   = true -> null
      - private_ipv6_google_access = "DISABLE_GOOGLE_ACCESS" -> null
      - project                    = "tbd-2025z-318384" -> null
      - purpose                    = "PRIVATE" -> null
      - region                     = "europe-west1" -> null
      - secondary_ip_range         = [
          - {
              - ip_cidr_range = "10.116.128.0/17"
              - range_name    = "gke-europe-west1-demo-lab-1a15c70e-gke-pods-5212841f"
            },
        ] -> null
      - self_link                  = "https://www.googleapis.com/compute/v1/projects/tbd-2025z-318384/regions/europe-west1/subnetworks/composer-subnet-01" -> null
      - stack_type                 = "IPV4_ONLY" -> null
        # (6 unchanged attributes hidden)

      - log_config {
          - aggregation_interval = "INTERVAL_10_MIN" -> null
          - filter_expr          = "true" -> null
          - flow_sampling        = 0.5 -> null
          - metadata             = "INCLUDE_ALL_METADATA" -> null
          - metadata_fields      = [] -> null
        }
    }

  # module.dataproc.google_dataproc_cluster.tbd-dataproc-cluster will be created
  + resource "google_dataproc_cluster" "tbd-dataproc-cluster" {
      + effective_labels              = (known after apply)
      + graceful_decommission_timeout = "0s"
      + id                            = (known after apply)
      + name                          = "tbd-cluster"
      + project                       = "tbd-2025z-318384"
      + region                        = "europe-west1"
      + terraform_labels              = (known after apply)

      + cluster_config {
          + bucket         = (known after apply)
          + staging_bucket = "tbd-2025z-318384-dataproc-staging"
          + temp_bucket    = "tbd-2025z-318384-dataproc-temp"

          + auxiliary_node_groups (known after apply)

          + dataproc_metric_config (known after apply)

          + endpoint_config {
              + enable_http_port_access = true
              + http_ports              = (known after apply)
            }

          + gce_cluster_config {
              + internal_ip_only       = true
              + metadata               = {
                  + "PIP_PACKAGES" = "pandas<2 mlflow==2.3.1 google-cloud-storage==2.9.0 jupyterlab==3.6.3 dbt-core==1.8.7 dbt-spark==1.8.0"
                  + "vmDnsSetting" = "GlobalDefault"
                }
              + network                = (known after apply)
              + service_account        = (known after apply)
              + service_account_scopes = [
                  + "https://www.googleapis.com/auth/cloud-platform",
                ]
              + subnetwork             = "projects/tbd-2025z-318384/regions/europe-west1/subnetworks/subnet-01"
              + zone                   = (known after apply)

              + node_group_affinity (known after apply)

              + reservation_affinity (known after apply)

              + shielded_instance_config (known after apply)
            }

          + initialization_action {
              + script      = "gs://goog-dataproc-initialization-actions-europe-west1/python/pip-install.sh"
              + timeout_sec = 600
            }

          + master_config {
              + image_uri        = (known after apply)
              + instance_names   = (known after apply)
              + machine_type     = "e2-standard-2"
              + min_cpu_platform = (known after apply)
              + num_instances    = 1

              + disk_config {
                  + boot_disk_size_gb = 100
                  + boot_disk_type    = "pd-standard"
                  + num_local_ssds    = (known after apply)
                }
            }

          + preemptible_worker_config (known after apply)

          + software_config {
              + image_version       = "2.2.69-ubuntu22"
              + optional_components = [
                  + "JUPYTER",
                ]
              + properties          = (known after apply)
            }

          + worker_config {
              + image_uri         = (known after apply)
              + instance_names    = (known after apply)
              + machine_type      = "e2-standard-2"
              + min_cpu_platform  = (known after apply)
              + min_num_instances = (known after apply)
              + num_instances     = 2

              + disk_config {
                  + boot_disk_size_gb = 100
                  + boot_disk_type    = "pd-standard"
                  + num_local_ssds    = (known after apply)
                }
            }
        }

      + virtual_cluster_config (known after apply)
    }

  # module.dataproc.google_project_iam_member.dataproc_bigquery_data_editor will be created
  + resource "google_project_iam_member" "dataproc_bigquery_data_editor" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "tbd-2025z-318384"
      + role    = "roles/bigquery.dataEditor"
    }

  # module.dataproc.google_project_iam_member.dataproc_bigquery_user will be created
  + resource "google_project_iam_member" "dataproc_bigquery_user" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "tbd-2025z-318384"
      + role    = "roles/bigquery.user"
    }

  # module.dataproc.google_project_iam_member.dataproc_worker will be created
  + resource "google_project_iam_member" "dataproc_worker" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "tbd-2025z-318384"
      + role    = "roles/dataproc.worker"
    }

  # module.dataproc.google_project_service.dataproc will be created
  + resource "google_project_service" "dataproc" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "tbd-2025z-318384"
      + service            = "dataproc.googleapis.com"
    }

  # module.dataproc.google_service_account.dataproc_sa will be created
  + resource "google_service_account" "dataproc_sa" {
      + account_id   = "tbd-2025z-318384-dataproc-sa"
      + disabled     = false
      + display_name = "Dataproc Service Account"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "tbd-2025z-318384"
      + unique_id    = (known after apply)
    }

  # module.dataproc.google_storage_bucket.dataproc_staging will be created
  + resource "google_storage_bucket" "dataproc_staging" {
      + effective_labels            = (known after apply)
      + force_destroy               = true
      + id                          = (known after apply)
      + location                    = "EUROPE-WEST1"
      + name                        = "tbd-2025z-318384-dataproc-staging"
      + project                     = "tbd-2025z-318384"
      + project_number              = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = (known after apply)
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning {
          + enabled = true
        }

      + website (known after apply)
    }

  # module.dataproc.google_storage_bucket.dataproc_temp will be created
  + resource "google_storage_bucket" "dataproc_temp" {
      + effective_labels            = (known after apply)
      + force_destroy               = true
      + id                          = (known after apply)
      + location                    = "EUROPE-WEST1"
      + name                        = "tbd-2025z-318384-dataproc-temp"
      + project                     = "tbd-2025z-318384"
      + project_number              = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = (known after apply)
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning {
          + enabled = true
        }

      + website (known after apply)
    }

  # module.dataproc.google_storage_bucket_iam_member.staging_bucket_iam will be created
  + resource "google_storage_bucket_iam_member" "staging_bucket_iam" {
      + bucket = "tbd-2025z-318384-dataproc-staging"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.objectAdmin"
    }

  # module.dataproc.google_storage_bucket_iam_member.temp_bucket_iam will be created
  + resource "google_storage_bucket_iam_member" "temp_bucket_iam" {
      + bucket = "tbd-2025z-318384-dataproc-temp"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.objectAdmin"
    }

  # module.gcr.google_artifact_registry_repository.registry will be created
  + resource "google_artifact_registry_repository" "registry" {
      + create_time      = (known after apply)
      + description      = "TBD Docker repository"
      + effective_labels = (known after apply)
      + format           = "DOCKER"
      + id               = (known after apply)
      + location         = "europe"
      + mode             = "STANDARD_REPOSITORY"
      + name             = (known after apply)
      + project          = "tbd-2025z-318384"
      + repository_id    = "eu.gcr.io"
      + terraform_labels = (known after apply)
      + update_time      = (known after apply)

      + docker_config {
          + immutable_tags = false
        }
    }

  # module.gcr.google_project_service.api["artifactregistry.googleapis.com"] will be created
  + resource "google_project_service" "api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "tbd-2025z-318384"
      + service            = "artifactregistry.googleapis.com"
    }

Plan: 13 to add, 0 to change, 1 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "iac_service_account" but a
value was found in file "env/project.tfvars". If you meant to use this value,
add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

Warning: Value for undeclared variable

The root module does not declare a variable named
"ai_notebook_instance_owner" but a value was found in file
"env/project.tfvars". If you meant to use this value, add a "variable" block
to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @Kutyl87, Action: `pull_request`, Working Directory: ``, Workflow: `Tech Tests`*